In [39]:
#Dataframe in pandas part-1

In [40]:
import pandas as pd
import numpy as np

In [41]:
info = { 'Name': ['Krishna','Mohan','Madan','Kanha','Narayan'],    #creating a dictionary
        'Roll_Number':[1,2,3,4,5],
        'Score': [95,100,98,99,98.5]
    
        }

In [42]:
type(info) # checking the type of variable

dict

In [43]:
data_frame_info=pd.DataFrame(info)  # converting dictionary to dataframe and storing it in variable

In [44]:
info

{'Name': ['Krishna', 'Mohan', 'Madan', 'Kanha', 'Narayan'],
 'Roll_Number': [1, 2, 3, 4, 5],
 'Score': [95, 100, 98, 99, 98.5]}

In [45]:
type(data_frame_info)

pandas.core.frame.DataFrame

In [46]:
data_frame_info

      Name  Roll_Number  Score
0  Krishna            1   95.0
1    Mohan            2  100.0
2    Madan            3   98.0
3    Kanha            4   99.0
4  Narayan            5   98.5

In [123]:
data_frame_info.Name # extracting column from dataframe

1    Krishna
2      Mohan
3      Madan
4      Kanha
5    Narayan
Name: Name, dtype: object

In [48]:
data_frame_info.head() #prints first five rows (default is 5)

      Name  Roll_Number  Score
0  Krishna            1   95.0
1    Mohan            2  100.0
2    Madan            3   98.0
3    Kanha            4   99.0
4  Narayan            5   98.5

In [22]:
data_frame_info.head(3) #prints first 3 values

      Name  Roll_Number  Score
0  Krishna            1   95.0
1    Mohan            2  100.0
2    Madan            3   98.0

In [23]:
data_frame_info.tail() #prints first five rows (default is 5)

      Name  Roll_Number  Score
0  Krishna            1   95.0
1    Mohan            2  100.0
2    Madan            3   98.0
3    Kanha            4   99.0
4  Narayan            5   98.5

In [24]:
data_frame_info.tail(2) #prints last 2 rows

      Name  Roll_Number  Score
3    Kanha            4   99.0
4  Narayan            5   98.5

In [26]:
data_frame_info.columns # prints the name of all columns

Index(['Name', 'Roll_Number', 'Score'], dtype='object')

In [124]:
data_frame_info['Name'] #same as data_frame_info.Name

1    Krishna
2      Mohan
3      Madan
4      Kanha
5    Narayan
Name: Name, dtype: object

In [31]:
data_frame_info['Name','Roll_Number'] # trying to extract multiple columns using comma , will give error
                                    #to solve this, need to use another pair of []

KeyError: ('Name', 'Roll_Number')

In [32]:
data_frame_info[['Name','Roll_Number']] # extracting multiple columns

      Name  Roll_Number
0  Krishna            1
1    Mohan            2
2    Madan            3
3    Kanha            4
4  Narayan            5

In [59]:
data_frame_info[['Name','Roll_Number','Score']] # extracting multiple columns

      Name  Roll_Number  Score
1  Krishna            1   95.0
2    Mohan            2  100.0
3    Madan            3   98.0
4    Kanha            4   99.0
5  Narayan            5   98.5

In [60]:
#in the dataframe, indexing starts from zero,we will now make it start from 1

In [61]:
data_frame_info.index=[1,2,3,4,5] #assigning index values

In [62]:
data_frame_info

      Name  Roll_Number  Score
1  Krishna            1   95.0
2    Mohan            2  100.0
3    Madan            3   98.0
4    Kanha            4   99.0
5  Narayan            5   98.5

In [ ]:
#loc and iloc for slicing

In [88]:
data_frame_info.loc[1] #extracting 1st row (all columns of 1st row)

Name           Krishna
Roll_Number          1
Score             95.0
Name: 1, dtype: object

In [89]:
data_frame_info.iloc[1] #extracting row at the 1st INDEX (indexing starts from zero)

Name           Mohan
Roll_Number        2
Score          100.0
Name: 2, dtype: object

In [92]:
data_frame_info.loc[2,'Score'] #2nd row (not index) and 'Score'column, in loc, column name must be menioned as label

100.0

In [94]:
data_frame_info.iloc[[2,3]] # in iloc, column number should be given and extra pair of[] is needed

    Name  Roll_Number  Score
3  Madan            3   98.0
4  Kanha            4   99.0

In [126]:
data_frame_info.loc[2:4] # extracting rows from 2 to 4, all columns as default

    Name  Class  Roll_Number  Score
2  Mohan      6            2  100.0
3  Madan      7            3   98.0
4  Kanha      8            4   99.0

In [77]:
data_frame_info.loc[[2,4],['Roll_Number','Score']] # multiple rows and columns

   Roll_Number  Score
2            2  100.0
4            4   99.0

In [100]:
data_frame_info.iloc[[2,4],[0,2]] #multiple row and columns with index

      Name  Score
3    Madan   98.0
5  Narayan   98.5

In [102]:
data_frame_info.dtypes # shows data types in the dataframe

Name            object
Roll_Number      int64
Score          float64
dtype: object

In [104]:
data_frame_info.info # shows information about the dataframe

<bound method DataFrame.info of       Name  Roll_Number  Score
1  Krishna            1   95.0
2    Mohan            2  100.0
3    Madan            3   98.0
4    Kanha            4   99.0
5  Narayan            5   98.5>

In [105]:
data_frame_info.size #number of elements in dataframe

15

In [107]:
data_frame_info.at[3,'Score'] # value of 'Score' at the 3rd Row

98.0

In [114]:
data_frame_info.iat[3,2] # value at 3rd index row and 2nd index column (index starts at zero in python)

99.0

In [115]:
#Inserting column into DataFrame at specified location.

#Raises a ValueError if column is already contained in the DataFrame, unless allow_duplicates is set to True.

In [116]:
#syntax DataFrame.insert(location, column_name, value, allow_duplicates=No_default)

In [117]:
data_frame_info.insert(1,'Class',[5,6,7,8,9])

In [118]:
data_frame_info

      Name  Class  Roll_Number  Score
1  Krishna      5            1   95.0
2    Mohan      6            2  100.0
3    Madan      7            3   98.0
4    Kanha      8            4   99.0
5  Narayan      9            5   98.5

In [119]:
data_frame_info.insert(4,'Class',[5,6,7,8,9]) # will show error as column with 'Class' already exists

ValueError: cannot insert Class, already exists

In [121]:
data_frame_info.to_excel("output.xlsx",sheet_name='sheet_name_1') #exporting dataframe as .xlsx file